<template>
  <div class="col-sm-4 chat_block">
    <div class="chat">
        <div class="chat_title">ID: 123123</div>
        <div class="chat_messages" style="overflow-y:scroll;">
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="left_message">
            <div class="message left">Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?</div>
          </div>
          <div class="left_message">
            <div class="message left">Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?</div>
          </div>
          <div class="left_message">
            <div class="message left">Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?</div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>
          <div class="right_message">
            <div class="message right">Все гуд! У тебя как? Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя
              как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?Все гуд! У тебя как?
            </div>
          </div>

        </div>
      </div>
    </div>
    <div class="col-sm-6">
        <div class="stat_title">Результат</div>
        <div>Метрика - 15%</div>

        <BarChart />
    </div>
</template>
  
<script>

</script>